Repository: BellevueCollege/PluginOfCASinessPlus4
Catalog: languages/wpcasldap-*.po
Languages: fr_fr

source: You are now logged off.
fr_fr: Vous êtes maintenant déconnecté(e).

source: WordPress CAS Client plugin not configured.
fr_fr: Le plugin Wordpress CAS Client n'est pas configuré.

source: Sorry, this feature is disabled.
fr_fr: Désolé, cette fonctionnalité est désactivée.

source: Feature disabled
fr_fr: Fonctionnalité désactivée

source: Access to this site is restricted.
fr_fr: L'accès à ce site est restreint.

source: %s - Access restricted
fr_fr: %s - Accès restreint

source: Authentication
fr_fr: Authentification

source: Please wait
fr_fr: Merci de patienter

source: You will be redirected soon to the login page.
fr_fr: Vous allez être redirigé(e) vers la page de connexion.

source: If you aren't automatically redirected, please click on <a href='%s'>this link</a>.
fr_fr: Si vous n'êtes pas automatiquement redirigé(e), merci de cliquer sur <a href='%s'>ce lien</a>.

source: CAS Client
fr_fr: Client CAS

source: Configuration settings for WordPress CAS Client
fr_fr: Paramètres de configuration de WordPress CAS Client

source: Note
fr_fr: Remarque

source: Now that you've activated this plugin, WordPress is attempting to authenticate using CAS, even if it's not configured or misconfigured.
fr_fr: Maintenant que ce plugin est activé, WordPress tente d'authentifier en utilisant CAS, même si il n'est pas (ou mal) configuré.

source: Save yourself some trouble, open up another browser or use another machine to test logins. That way you can preserve this session to adjust the configuration or deactivate the plugin.
fr_fr: Il est recommandé de tester la connexion depuis un autre navigateur ou un autre ordinateur. De cette façon, vous pouvez conserver cette session pour ajuster la configuration ou désactiver le plug-in au besoin.

source: phpCAS include path
fr_fr: Chemin d'inclusion de phpCAS

source: Note: The phpCAS library is required for this plugin to work. We need to know the server absolute path to the CAS.php file.
fr_fr: Remarque : La librairie phpCAS est indispensable pour que ce plugin fonctionne. Vous devez connaître le chemin absolu du fichier CAS.php sur le serveur.

source: CAS.php path
fr_fr: Chemin du fichier CAS.php

source: WARNING : The path to CAS.php file currently defined is incorrect!
fr_fr: ATTENTION : Le chemin du fichier CAS.php renseigné est incorrect !

source: phpCAS::client() parameters
fr_fr: Paramètres de phpCAS::client()

source: CAS version
fr_fr: Version de CAS

source: Server Hostname
fr_fr: Nom du serveur

source: Server Port
fr_fr: Port du serveur

source: Server Path
fr_fr: Chemin du serveur

source: Disable CAS logout
fr_fr: Désactiver la déconnexion CAS

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Note: If you disable CAS logout, when a user click on the logout link, he will only be logged off from Wordpress, not from the CAS server (and potential other CAS authenticated services).
fr_fr: Remarque : Si vous désactivez la déconnexion CAS, quand l'utilisateur cliquera sur le lien de déconnexion, il sera déconnecté uniquement au niveau de WordPress, et non au niveau du serveur CAS (et potentiellement des autres services utilisant l'authentification CAS).

source: Redirect to CAS login page using Javascript
fr_fr: Rediriger vers la page de connexion CAS en utilisant Javascript

source: Note: Using Javascript to redirect user to CAS login page enables to keep hashtag in URL (if present).
fr_fr: Remarque : Utiliser Javascript pour rediriger l'utilisateur vers la page de connexion CAS permet de conserver l'hashtag dans l'URL (s'il est présent).

source: Treatment of unregistered users
fr_fr: Traitement des utilisateurs non-inscris

source: Add to database
fr_fr: Ajouter à la base de données

source: Default role
fr_fr: Rôle par défaut

source: Note: This default role is only used to create the user on its first connection. Afterwards, the user role could be configured in Wordpress and will not be overwritten from LDAP.
fr_fr: Remarque : Ce rôle par défaut est uniquement utilisé pour créer l'utilisateur lors de sa première connexion. Par la suite, le rôle de l'utilisateur peut-être configuré dans Wordpress et ne sera écrasé depuis le LDAP.

source: Use LDAP to get user info
fr_fr: Utiliser LDAP pour récupérer les informations de l'utilisateur

source: E-mail Suffix
fr_fr: Suffixe du courriel

source: Note: This suffix is used to constitute user email if it couldn't be retreived from LDAP. You must only enter the email domain name (without the '@').
fr_fr: Remarque : Ce suffixe est utilisé pour composer le courriel de l'utilisateur si celui-ci n'a pu être récupéré depuis LDAP. Vous devez saisir uniquement le nom de domaine de messagerie (sans le '@').

source: LDAP parameters
fr_fr: Paramètres LDAP

source: LDAP Host
fr_fr: Serveur LDAP

source: LDAP Port
fr_fr: Port du serveur LDAP

source: LDAP Base DN
fr_fr: Base DN du serveur LDAP

source: LDAP Bind DN
fr_fr: DN de connexion au serveur LDAP

source: LDAP Bind password
fr_fr: Mot de passe de connexion au serveur LDAP

source: LDAP users Base DN
fr_fr: Base DN des utilisateurs LDAP

source: Note: This parameter is optional. The base DN of the LDAP server is used otherwise.
fr_fr: Remarque : Ce paramètre est optionnel. Le base DN du serveur LDAP sera utilisé à défaut.

source: LDAP users filter
fr_fr: Filtre de recherche des utilisateurs LDAP

source: Note: This parameter is optional. If it's provided, this filter will be combined with the LDAP filter generating from the user's login.
fr_fr: Remarque : Ce paramètre est optionnel. S'il est fourni, ce filtre sera combiné avec le filtre LDAP généré à partir de l'identifiant de l'utilisateur.

source: LDAP groups Base DN
fr_fr: Base DN des groupes LDAP

source: LDAP groups filter
fr_fr: Filtre de recherche des groupes LDAP

source: Note: This parameter is required to retreive the user's groups. In this filter, the keywords enclosed by brace will be replace by user's corresponding information. For instance, {user_login} will be replace by the user's login or {user_email} by the user's email. You also can use the keyword {user_dn} that will be replaced by the LDAP user object's DN.
fr_fr: Remarque : Ce paramètre est obligatoire pour récupérer les groupes de l'utilisateur. Dans ce filtre, les mots clé entourés par des accolades seront remplacés par les informations correspondantes de l'utilisateur. Par exemple, {user_login} sera remplacé par l'identifiant de l'utilisateur ou {user_email} par l'email de l'utilisateur. Vous pouvez également utiliser le mot clé {user_dn} qui sera remplacé par le DN de l'objet LDAP de l'utilisateur.

source: LDAP attributes mapping
fr_fr: Correspondance des attributs LDAP

source: You have to configure here which LDAP attributes could be mapped with Wordpress user profil information.
fr_fr: Vous devez configurer ici quels attributs LDAP peuvent être utilisés pour renseigner les informations du profil de l'utilisateur dans Wordpress.

source: the login
fr_fr: l'identifiant

source: the first name
fr_fr: le prénom

source: the last name
fr_fr: le nom de famille

source: the nickname
fr_fr: le surnom

source: the nice name
fr_fr: le nom d'affichage

source: the role
fr_fr: le rôle

source: the affiliations
fr_fr: les affiliations

source: the email
fr_fr: le courriel

source: the alternative email
fr_fr: le courriel alternatif

source: LDAP attribut for %s
fr_fr: L'attribut LDAP pour %s

source: Site access restriction
fr_fr: Restriction d'accès au site

source: You can restrict access to the public website here:
fr_fr: Vous pouvez restreindre l'accès au site public ici :

source: If you choose to allow access only to <em>CAS authenticated users</em>, the user will be authenticated using CAS and authenticated in Wordpress only if he already has an account.
fr_fr: Si vous choisissez d'autoriser l'accès uniquement <em>aux utilisateurs authentifiés via CAS</em>, l'utilisateur sera authentifié via CAS puis via Wordpress uniquement s'il y possède déjà un compte utilisateur.

source: If you choose to allow access only to <em>Wordpress authenticated users</em>, the user will be authenticated using CAS and authenticated in Wordpress if he already has an account or if you choose to allow adding user in database. Otherwise, the access will be denied.
fr_fr: Si vous choisissez d'autoriser l'accès uniquement <em>aux utilisateurs authentifiés par Wordpress</em>, l'utilisateur sera authentifié via CAS puis via Wordpress s'il y possède déjà un compte utilisateur ou si vous avez choisi d'autoriser l'ajout des utilisateurs non-inscrits dans la base de données. Autrement, l'accès sera refusé.

source: If you choose to allow access to <em>everyone</em>, no restriction will be applied.
fr_fr: Si vous choisissez d'autoriser l'accès à <em>tout le monde</em>, aucune restriction ne sera appliquée.

source: Restrict site access to
fr_fr: Restreindre l'accès à

source: Everyone
fr_fr: Tout le monde

source: CAS authenticated users
fr_fr: aux utilisateurs authentifiés via CAS

source: Wordpress authenticated users
fr_fr: aux utilisateurs authentifiés via Wordpress

source: Access denied redirect URL
fr_fr: URL de redirection en cas d'accès interdit

source: Save
fr_fr: Enregistrer
